---
kind: type
id: T:Autodesk.Revit.DB.TextNoteType
source: html/2991b6af-daf6-463d-3796-8b83fdbd344f.htm
---
# Autodesk.Revit.DB.TextNoteType

An object that represents a text note style.

## Syntax (C#)
```csharp
public class TextNoteType : TextElementType
```